Revit 2026 API

# SpaceDesignCoolingLoad Property

---

Get or set the Design Cooling Load of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double DesignCoolingLoad { get; set; }
```
```vb
Public Property DesignCoolingLoad As Double
	Get
	Set
```
```cpp
public:
property double DesignCoolingLoad {
	double get ();
	void set (double value);
}
```
```fsharp
member DesignCoolingLoad : float with get, set
```

#### Property Value

Double

This property is used to get or set the Design Cooling Load of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace